
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13036571375)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * random_password.vm_user_password
  * module.k8s_worker_nodes__prod.proxmox_vm_qemu.worker[&#34;1&#34;]
* Delete
  * random_password.worker_ci_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # random_password.vm_user_password will be created
  + resource "random_password" "vm_user_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 3
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.worker_ci_user_password will be destroyed
  # (because random_password.worker_ci_user_password is not in configuration)
  - resource "random_password" "worker_ci_user_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 3 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.k8s_worker_nodes__prod.proxmox_vm_qemu.worker["1"] will be created
  + resource "proxmox_vm_qemu" "worker" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + ciupgrade              = true
      + ciuser                 = "machine-user"
      + clone                  = "alma-9"
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.21/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "prod-k8s-wk-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEC6sFg741zloMPUOpnXmmStdVUhy/9ousPBJ6I6nX33 machine-user@lucky-proxmox-01
        EOT
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;worker"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 821

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":51,"Program":"tfcmt","SHA1":"d4b887c5ab970ac65ed58d78fc642a7c8b055ec3","Vars":{},"WorkflowName":"Terraform CI"} -->